Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПродажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена0</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешитьПродажу</Name>
							<Comment>(не используется)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСвойства</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСвойства</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСвойства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена0</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныЗакупки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(удалить, заменен на ТипНоменклатуры)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УстановкаЦен/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьСпецификацию		= Истина;
	ПоказыватьДействующуюЦену	= Истина;
	ПоказыватьИзменениеЦен		= Ложь;
	ПоказыватьЦенуЗакупки		= Истина;        
	
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

	ГруппаПодменю	 			= Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыПодменюЗаполнить;
	
	// Сгенерим префиксы ВидовЦен; Заполним и  проптичим СписокВыбранныеВидыЦен; добавим колонки ТЗ Товары 
	
	ПрефиксыВидовЦен = Новый Соответствие;
	
	Выборка = Справочники.ВидыЦен.Выбрать();
	Пока Выборка.Следующий() Цикл
		
	    ИмяПредопределенныхДанных = Выборка.Ссылка.ИмяПредопределенныхДанных;
		Если ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда 
			Префикс = ИмяПредопределенныхДанных;
		Иначе
			Префикс = СтрЗаменить(Выборка.Наименование, " ", "");
		КонецЕсли; 
		ПрефиксыВидовЦен.Вставить(Выборка.Ссылка, Префикс);
		ДобавитьРеквизитыИЭлементыТабличнойЧастиПоВидуЦен(Выборка.Ссылка, Префикс);
		
		Если НЕ Выборка.ПометкаУдаления Тогда 
			Пометка = Объект.ВидыЦен.Выгрузить().ВыгрузитьКолонку("ВидЦены").Найти(Выборка.Ссылка) <> Неопределено;
			СписокВыбранныеВидыЦен.Добавить(Выборка.Ссылка, , Пометка); 
		КонецЕсли;
		
	КонецЦикла;
	
	КэшДанных = Новый Структура("ЗначенияПодбора,ПрефиксыВидовЦен", Новый Соответствие(), ПрефиксыВидовЦен);

	// создадим меню заполнения по группам подбора номенклатуры 
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Номенклатура.ГруппаПодбора
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	НЕ Номенклатура.ГруппаПодбора ЕСТЬ NULL
	             |	И Номенклатура.ГруппаПодбора <> ЗНАЧЕНИЕ(Справочник.ГруппыПодбораНоменклатуры.ПустаяСсылка)";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Истина Тогда 
			
			Представление = СтрокаБуквами(Выборка.ГруппаПодбора);
			ЭлементПодменю = ЭтаФорма.Элементы.Добавить("Подменю_" + Представление, Тип("ГруппаФормы"), 
														ГруппаПодменю.ПодчиненныеЭлементы.ПодменюЗаполнитьПоТоварнойГруппе);
			ЭлементПодменю.Вид = ВидГруппыФормы.Подменю;   
			ЭлементПодменю.Заголовок = Выборка.ГруппаПодбора;
			запрВлож = Новый Запрос;  
			запрВлож.УстановитьПараметр("Ссылка", Выборка.ГруппаПодбора);
			запрВлож.Текст = "ВЫБРАТЬ
			             |	Номенклатура.Ссылка КАК Ссылка
			             |ИЗ
			             |	Справочник.Номенклатура КАК Номенклатура
			             |ГДЕ
			             |	Номенклатура.ЭтоГруппа
			             |	И НЕ Номенклатура.ПометкаУдаления
			             |	И Номенклатура.ГруппаПодбора В ИЕРАРХИИ(&Ссылка)";   
			ВыборкаВлож = запрВлож.Выполнить().Выбрать();
			Пока ВыборкаВлож.Следующий() Цикл 
				ПредставлениеВлож = СтрокаБуквами(ВыборкаВлож.Ссылка);
				Кмд = ЭтаФорма.Команды.Добавить("Команда_" + ПредставлениеВлож);
				Кмд.Действие = "НажатиеКнопкиПодбораМеню";
				Кмд.Заголовок = ВыборкаВлож.Ссылка;
				Элемент = ЭтаФорма.Элементы.Добавить("Кнопка_" + ПредставлениеВлож, Тип("КнопкаФормы"), ЭлементПодменю);
				Элемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
				Элемент.ИмяКоманды 	= "Команда_" + ПредставлениеВлож;
				КэшДанных.ЗначенияПодбора.Вставить(Элемент.ИмяКоманды, ВыборкаВлож.Ссылка); 
			КонецЦикла;
			
		Иначе
			
			Представление = СтрокаБуквами(Выборка.ГруппаПодбора);
			Кмд = ЭтаФорма.Команды.Добавить("Команда_" + Представление);
			Кмд.Действие = "НажатиеКнопкиГруппыПодбора";
			Кмд.Заголовок = Выборка.ГруппаПодбора;

			Элемент = ЭтаФорма.Элементы.Добавить("Кнопка_"+Представление, Тип("КнопкаФормы"), ГруппаПодменю);
			Элемент.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;
			Элемент.ИмяКоманды 	= "Команда_" + Представление;
			Элемент.Картинка 	= БиблиотекаКартинок.ПерейтиНазад; 
			Элемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
			запр = Новый Запрос;  
			запр.УстановитьПараметр("Ссылка", Выборка.ГруппаПодбора);
			запр.Текст = "ВЫБРАТЬ
			             |	Номенклатура.Ссылка КАК Ссылка
			             |ИЗ
			             |	Справочник.Номенклатура КАК Номенклатура
			             |ГДЕ
			             |	Номенклатура.ЭтоГруппа
			             |	И НЕ Номенклатура.ПометкаУдаления
			             |	И Номенклатура.ГруппаПодбора В ИЕРАРХИИ(&Ссылка)";
			МассивГрупп = Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
			КэшДанных.ГруппыПодбора.Вставить(Элемент.ИмяКоманды, Новый Структура("ГруппаПодбора, ГруппыНоменклатуры", Выборка.ГруппаПодбора, МассивГрупп));  
			
		КонецЕсли;
		
	КонецЦикла;

	// создадим меню заполнения по производителям              
	
	Запр2 = Новый Запрос;
	Запр2.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Номенклатура.Производитель КАК Производитель
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Производитель <> ЗНАЧЕНИЕ(Справочник.Производители.ПустаяСсылка)
	             |	И НЕ Номенклатура.ПометкаУдаления";
	Выборка2 = запр2.Выполнить().Выбрать();
	Пока Выборка2.Следующий() Цикл 
		Представление2 = СтрокаБуквами(Выборка2.Производитель);
		Кмд = ЭтаФорма.Команды.Добавить("Команда2_" + Представление2);
		Кмд.Действие = "НажатиеКнопкиПодбораМеню";
		Кмд.Заголовок = Выборка2.Производитель;
		Элемент = ЭтаФорма.Элементы.Добавить("Кнопка2_" + Представление2, Тип("КнопкаФормы"), 
											ГруппаПодменю.ПодчиненныеЭлементы.ПодменюЗаполнитьПоБренду);
		Элемент.Вид 		= ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элемент.ИмяКоманды 	= "Команда2_" + Представление2;
		КэшДанных.ЗначенияПодбора.Вставить(Элемент.ИмяКоманды, Выборка2.Производитель); 
	КонецЦикла;

	// заполним ТЗ на форме значениями ТЧ
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	УстановкаЦенТовары.Номенклатура КАК Номенклатура,
	             |	УстановкаЦенТовары.ВидЦены КАК ВидЦены,
	             |	УстановкаЦенТовары.Цена0 КАК Цена0,
	             |	УстановкаЦенТовары.Цена1 КАК Цена1,
	             |	УстановкаЦенТовары.Порог1 КАК Порог1,
	             |	УстановкаЦенТовары.Цена2 КАК Цена2,
	             |	УстановкаЦенТовары.Порог2 КАК Порог2,
	             |	УстановкаЦенТовары.Цена3 КАК Цена3,
	             |	УстановкаЦенТовары.Порог3 КАК Порог3,
	             |	УстановкаЦенТовары.РазрешитьПродажу КАК РазрешитьПродажу,
	             |	УстановкаЦенТовары.НомСтроки КАК НомСтроки
	             |ИЗ
	             |	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |ГДЕ
	             |	УстановкаЦенТовары.Ссылка = &Ссылка
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	УстановкаЦенТовары.НомСтроки"; 
	РезультатЗапроса = Запр.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		Префикс = КэшДанных.ПрефиксыВидовЦен.Получить(Выборка.ВидЦены);       
		Если Товары.Количество() < Выборка.НомСтроки Тогда
			СтрокаТЗ = Товары.Добавить(); 
			СтрокаТЗ.Номенклатура = Выборка.Номенклатура;
		Иначе
		    СтрокаТЗ = Товары[Товары.Количество()-1];
		КонецЕсли;
		СтрокаТЗ[Префикс + "_Цена0"] = Выборка.Цена0;
		СтрокаТЗ[Префикс + "_Цена1"] = Выборка.Цена1;
		СтрокаТЗ[Префикс + "_Цена2"] = Выборка.Цена2;
		СтрокаТЗ[Префикс + "_Цена3"] = Выборка.Цена3;
		СтрокаТЗ[Префикс + "_Порог1"] = Выборка.Порог1;
		СтрокаТЗ[Префикс + "_Порог2"] = Выборка.Порог2;
		СтрокаТЗ[Префикс + "_Порог3"] = Выборка.Порог3;
		СтрокаТЗ["РазрешитьПродажу"] = Выборка.РазрешитьПродажу;
	КонецЦикла;
	
	
	ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	КоличествоПороговЦенПриИзменении(Неопределено);
	СписокТипыЦенПометкаПриИзменении(Неопределено);
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	// проверка дублей строк     
	
	Ошибки = Новый Соответствие;
	Для каждого СтрокаТЧ Из Товары Цикл
		НайдСтроки = Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура));
		Если НайдСтроки.ВГраница() > 0 Тогда  
			Стр = "";
			Для Инд = 0 По НайдСтроки.ВГраница() Цикл
				Стр = Стр + НайдСтроки[Инд].Номер + ", ";
			КонецЦикла;
			Ошибки.Вставить(СтрокаТЧ.Номенклатура, Стр);
		КонецЕсли;	
	КонецЦикла;
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибки = НСтр("ru = 'Найдены дубли в строках: '; en = 'Duplicates found in the lines: '") + Символы.ПС;
		Для каждого Ош Из Ошибки Цикл
			ТекстОшибки = СтрШаблон(НСтр("ru = '%1 %2 - строки %3%4'; en = '%1 %2 - lines %3%4'"), ТекстОшибки, Ош.Ключ, Ош.Значение, Символы.ПС);
		КонецЦикла;
		ТекстОшибки = Лев(ТекстОшибки, СтрДлина(ТекстОшибки)-3);	
		//Сообщить(ТекстОшибки);
		клОшибка(ТекстОшибки);
	КонецЕсли;
	
	// заполнение ТЧ ТипыЦен
	
	Объект.ВидыЦен.Очистить();
	Для каждого эл Из СписокВыбранныеВидыЦен Цикл
		Если эл.Пометка Тогда
		 	Объект.ВидыЦен.Добавить().ВидЦены = эл.Значение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// перенесем данные из ТЗ формы в ТЧ док-та
	
	ТекущийОбъект.Товары.Очистить();
 	ТЗ = Товары.Выгрузить();
   	Для каждого СтрокаТЗ Из ТЗ Цикл
		Для каждого СтрокаВЦ Из Объект.ВидыЦен Цикл
			Префикс = КэшДанных.ПрефиксыВидовЦен.Получить(СтрокаВЦ.ВидЦены);
			НовСтрока = ТекущийОбъект.Товары.Добавить();
			НовСтрока.НомСтроки 		= СтрокаТЗ.Ном;
			НовСтрока.ВидЦены 			= СтрокаВЦ.ВидЦены; 
			НовСтрока.Номенклатура 		= СтрокаТЗ.Номенклатура;   
			НовСтрока.РазрешитьПродажу 	= СтрокаТЗ.РазрешитьПродажу;
			НовСтрока.Цена0	= СтрокаТЗ[Префикс+"_Цена0"];
			Если Объект.ПороговЦен > 0 Тогда
				НовСтрока.Цена1		= СтрокаТЗ[Префикс+"_Цена1"];
				НовСтрока.Порог1	= СтрокаТЗ[Префикс+"_Порог1"];   
			КонецЕсли;	
			Если Объект.ПороговЦен > 1 Тогда
				НовСтрока.Цена2		= СтрокаТЗ[Префикс+"_Цена2"];
				НовСтрока.Порог2	= СтрокаТЗ[Префикс+"_Порог2"];   
			КонецЕсли;	
			Если Объект.ПороговЦен > 2 Тогда
				НовСтрока.Цена3		= СтрокаТЗ[Префикс+"_Цена3"];
				НовСтрока.Порог3	= СтрокаТЗ[Префикс+"_Порог3"];   
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаполнитьТаблицуЗначенийТовары(ВыбранноеЗначение); 
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Пользователи") Тогда
		    Номенклатура = ОтобраннаяНоменклатура("Менеджер", ВыбранноеЗначение);
			//         
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Производители") Тогда
			ЗаполнитьТаблицуЗначенийТовары(ВыбранноеЗначение); 
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
			ЗаполнитьТаблицуЗначенийТовары(ВыбранноеЗначение); 
		Иначе
		
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;                               
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПересчетЦен" Тогда
		Если Параметр.Было <> 0 И Параметр.Стало <> 0 Тогда
			Для каждого СтрокаТЧ Из Товары Цикл 
				Для каждого ТипЦены Из КэшДанных.ТипыЦен Цикл
					Префикс = ТипЦены.Представление;
					СтрокаТЧ[Префикс + "_ЦенаНовая"] = СтрокаТЧ[Префикс + "_ЦенаНовая"] / Параметр.Было * Параметр.Стало;
					СтрокаТЧ[Префикс + "_ЦенаКНовая"] = СтрокаТЧ[Префикс + "_ЦенаКНовая"] / Параметр.Было * Параметр.Стало;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура НажатиеКнопкиПодбораМеню(Команда)
	
	ЗаполнитьТаблицуЗначенийТовары(КэшДанных.ЗначенияПодбора.Получить(Команда.Имя));
	Модифицированность = Истина;
	 
 КонецПроцедуры 

//&НаКлиенте
//Процедура НажатиеКнопкиГруппыПодбора(Команда)
//	
//	Список = Новый СписокЗначений;
//	Список.ЗагрузитьЗначения(КэшДанных.ГруппыПодбора[Команда.Имя].ГруппыНоменклатуры);
//	//ВыбГруппа = ВыбратьИзМеню(Список, Элементы[СтрЗаменить(Команда.Имя,"Команда_","Кнопка_")]);
//	ВыбГруппа = ВыбратьИзМеню(Список, Элементы.ДекорацияМеню);
//	Если ВыбГруппа <> Неопределено Тогда
//		ЗаполнитьТаблицуЗначенийТовары(ВыбГруппа.Значение);
//		Модифицированность = Истина;
//	КонецЕсли;
//	 
// КонецПроцедуры 
 
#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСпецификациюПриИзменении(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьДействующуюЦенуПриИзменении(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИзменениеПриИзменении(Элемент)

	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьЦенуЗакупкиПриИзменении(Элемент)

	УстановитьВидимостьКолонок();

КонецПроцедуры

//&НаСервере
//Функция ДанныеСтроки()

//	Запр = Новый Запрос;
//	Запр.УстановитьПараметр("ДатаОстатков", );
//	Запр.УстановитьПараметр("Номенклатура", );
//	Запр.Текст = "ВЫБРАТЬ
//	             |	спрНоменклатура.Ссылка КАК Номенклатура,
//	             |	ЗначенияСвойствОбъектов.ЗначениеСвойства.Наименование КАК Картинка,
//	             |	ЦеныЗакупки.Цена,
//	             |	ЦеныПродажи.ВидЦены,
//	             |	ЦеныПродажи.Цена КАК Цена1,
//	             |	ЦеныПродажи.Количество
//	             |ИЗ
//	             |	Справочник.Номенклатура КАК спрНоменклатура
//	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	             |			ЦеныЗакупкиСрезПоследних.Номенклатура КАК Номенклатура,
//	             |			ЦеныЗакупкиСрезПоследних.Цена КАК Цена
//	             |		ИЗ
//	             |			РегистрСведений.ЦеныЗакупки.СрезПоследних(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ЦеныЗакупкиСрезПоследних) КАК ЦеныЗакупки
//	             |		ПО (ЦеныЗакупки.Номенклатура = спрНоменклатура.Ссылка)
//	             |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	             |			ЗначенияСвойствОбъектов.Объект КАК Объект,
//	             |			ЗначенияСвойствОбъектов.ЗначениеСвойства КАК ЗначениеСвойства
//	             |		ИЗ
//	             |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
//	             |		ГДЕ
//	             |			ЗначенияСвойствОбъектов.Свойство.Наименование = ""Спецификация"") КАК ЗначенияСвойствОбъектов
//	             |		ПО спрНоменклатура.Ссылка = ЗначенияСвойствОбъектов.Объект
//	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	             |			ЦеныПродажиСрезПоследних.Номенклатура КАК Номенклатура,
//	             |			ЦеныПродажиСрезПоследних.ВидЦены КАК ВидЦены,
//	             |			ЦеныПродажиСрезПоследних.Цена КАК Цена,
//	             |			ЦеныПродажиСрезПоследних.Количество КАК Количество,
//	             |			ЦеныПродажиСрезПоследних.Валюта КАК Валюта
//	             |		ИЗ
//	             |			РегистрСведений.ЦеныПродажи.СрезПоследних(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ЦеныПродажиСрезПоследних) КАК ЦеныПродажи
//	             |		ПО (ЦеныПродажи.Номенклатура = спрНоменклатура.Ссылка)
//	             |ГДЕ
//	             |	спрНоменклатура.Ссылка В(&Номенклатура)";
//	

//КонецФункции 

#КонецОбласти


#Область СозданиеТаблицыЗначенийНаФорме

&НаСервере
Функция РеквизитДобавленРаннее(ИмяТабличнойЧасти, ПутьКРеквизитуИИмяЭлемента)
	
	МассивРеквизитов = ПолучитьРеквизиты(ИмяТабличнойЧасти);
	Для каждого РеквизитФормы Из МассивРеквизитов Цикл
		
		Если РеквизитФормы.Имя = ПутьКРеквизитуИИмяЭлемента Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ДобавитьРеквизитыИЭлементыТабличнойЧастиПоВидуЦен(ВыбранныйВидЦен, ПрефиксРеквизитов)
	
	КонстПорог = 3;
	ПутьРеквизита = "Товары";
	ШиринаКолонки = 11;
	
	// ::: СОЗДАНИЕ РЕКВИЗИТОВ
	//ПрефиксРеквизитов = КэшДанных.ПрефиксыВидовЦен.Получить(ВыбранныйВидЦен);

	МассивРеквизитов 	= Новый Массив;

	ТипЧислоЦелое 		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный));
	ТипЧислоПлюс 		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ТипЧислоЛюбое 		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой));
	ТипСтрока			= Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20));
	ТипБулево			= Новый ОписаниеТипов("Булево");
	
	// Цена старая (относительно Цены0)
	
	РеквизитЦенаСтар	= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенаСтар",		ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена старая'; en = 'Price before'"));
	РеквизитДельта		= Новый РеквизитФормы(ПрефиксРеквизитов + "_Дельта",		ТипЧислоЛюбое,	ПутьРеквизита, "Δ");
		
		МассивРеквизитов.Добавить(РеквизитЦенаСтар);
		МассивРеквизитов.Добавить(РеквизитДельта);
		
	// Цена0
	
	РеквизитЦена		= Новый РеквизитФормы(ПрефиксРеквизитов + "_Цена0",			ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена новая'; en = 'Price new'"));
	РеквизитЦенуИзменили= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенуИзменили0",	ТипБулево,		ПутьРеквизита, НСтр("ru = 'Служебный'; en = 'Служебный'"));

	МассивРеквизитов.Добавить(РеквизитЦена);
	МассивРеквизитов.Добавить(РеквизитЦенуИзменили);
		
	// Цена1-Цена3
	
	Для Порог = 1 ПО КонстПорог Цикл 
		
		РеквизитЦена		= Новый РеквизитФормы(ПрефиксРеквизитов + "_Цена" + Порог,			ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена новая'; en = 'Price new'"));
		РеквизитЦенуИзменили= Новый РеквизитФормы(ПрефиксРеквизитов + "_ЦенуИзменили" + Порог,	ТипБулево,		ПутьРеквизита, НСтр("ru = '_Служебный'; uk = '_Службовий'"));
		РеквизитПорог		= Новый РеквизитФормы(ПрефиксРеквизитов + "_Порог" + Порог,			ТипЧислоЦелое,	ПутьРеквизита, НСтр("ru = 'от количества'; en = 'Quantity'"));
		//РеквизитЦенаКДо		= Новый РеквизитФормы(ПрефиксРеквизитов + Порог + "_ЦенаКДо",		ТипСтрока,		ПутьРеквизита, НСтр("ru = 'Цена от К. до'; en = 'Price Q. before'"));
		//РеквизитДельтаК		= Новый РеквизитФормы(ПрефиксРеквизитов + Порог + "_ДельтаК",		ТипЧислоЛюбое,	ПутьРеквизита, "Δ");
		//РеквизитЦенаКНовая	= Новый РеквизитФормы(ПрефиксРеквизитов + Порог + "_ЦенаКНовая",	ТипЧислоПлюс,	ПутьРеквизита, НСтр("ru = 'Цена от К. новая'; en = 'Price Q. new'"));
		//РеквизитЦенуКИзменили= Новый РеквизитФормы(ПрефиксРеквизитов + Порог + "_ЦенуКИзменили",ТипБулево,		ПутьРеквизита, НСтр("ru = '_СлужебныйК'; uk = '_Службовий'"));
		
		МассивРеквизитов.Добавить(РеквизитЦена);
		МассивРеквизитов.Добавить(РеквизитЦенуИзменили);
		МассивРеквизитов.Добавить(РеквизитПорог);
		//МассивРеквизитов.Добавить(РеквизитЦенаКДо);
		//МассивРеквизитов.Добавить(РеквизитДельтаК);
		//МассивРеквизитов.Добавить(РеквизитЦенаКНовая);
		//МассивРеквизитов.Добавить(РеквизитЦенуКИзменили);
		
	КонецЦикла;

	ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
	
	// ::: СОЗДАНИЕ ЭЛЕМЕНТОВ ФОРМЫ

	ГруппаВидЦены					= Элементы.Добавить(ПрефиксРеквизитов, Тип("ГруппаФормы"), Элементы[ПутьРеквизита]);
	ГруппаВидЦены.Заголовок			= СтрШаблон("%1 (%2)", ВыбранныйВидЦен.Наименование, ВыбранныйВидЦен.Валюта.Символ);
	ГруппаВидЦены.Группировка		= ГруппировкаКолонок.Горизонтальная;
	ГруппаВидЦены.ОтображатьВШапке	= Истина;
	ГруппаВидЦены.ОтображатьЗаголовок = Истина;

	ЭлементЦенаСтар					= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаСтар", Тип("ПолеФормы"), ГруппаВидЦены);
	ЭлементЦенаСтар.Вид				= ВидПоляФормы.ПолеВвода;
	ЭлементЦенаСтар.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаСтар";
	ЭлементЦенаСтар.Ширина			= ШиринаКолонки;
	//ЭлементЦенаСтар.Видимость		= ПоказыватьЦенуЗакупки;
	ЭлементЦенаСтар.ТолькоПросмотр	= Истина;
	ЭлементЦенаСтар.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	ЭлементЦенаСтар.РастягиватьПоГоризонтали = Ложь;
	
	ГруппаПорогиИЦеныОбщ					= Элементы.Добавить(ПрефиксРеквизитов + "_ГрПорогиИЦеныОбщ", Тип("ГруппаФормы"), ГруппаВидЦены);
	ГруппаПорогиИЦеныОбщ.Группировка		= ГруппировкаКолонок.Вертикальная;
	ГруппаПорогиИЦеныОбщ.ОтображатьВШапке	= Ложь;

	ЭлементЦена0					= Элементы.Добавить(ПрефиксРеквизитов + "_Цена0", Тип("ПолеФормы"), ГруппаПорогиИЦеныОбщ);
	ЭлементЦена0.Вид				= ВидПоляФормы.ПолеВвода;
	ЭлементЦена0.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_Цена0";

	ГруппаПорогиИЦены				= Элементы.Добавить(ПрефиксРеквизитов + "_ГрПорогиИЦены", Тип("ГруппаФормы"), ГруппаПорогиИЦеныОбщ);
	//ГруппаПорогиИЦены.Заголовок			= "количества";
	ГруппаПорогиИЦены.Группировка		= ГруппировкаКолонок.Горизонтальная;
	ГруппаПорогиИЦены.ОтображатьВШапке	= Ложь;
 	
	ГруппаПороги					= Элементы.Добавить(ПрефиксРеквизитов + "_ГрПороги", Тип("ГруппаФормы"), ГруппаПорогиИЦены);
	//ГруппаПороги.Заголовок			= "количества";
	ГруппаПороги.Группировка		= ГруппировкаКолонок.Вертикальная;
	ГруппаПороги.ОтображатьВШапке	= Ложь;
	//ГруппаПороги.ОтображатьЗаголовок = Истина;

	ГруппаЦены						= Элементы.Добавить(ПрефиксРеквизитов + "_ГрЦены", Тип("ГруппаФормы"), ГруппаПорогиИЦены);
	ГруппаЦены.Заголовок			= "цены";
	ГруппаЦены.Группировка			= ГруппировкаКолонок.Вертикальная;
	ГруппаЦены.ОтображатьВШапке		= Ложь;
	//ГруппаЦены.ОтображатьЗаголовок 	= Истина;
	
	Для Порог = 1 По КонстПорог Цикл
		
		ЭлементПорог 				= Элементы.Добавить(ПрефиксРеквизитов + "_Порог" + Порог, Тип("ПолеФормы"), ГруппаПороги);
		ЭлементПорог.Вид			= ВидПоляФормы.ПолеВвода;
		ЭлементПорог.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_Порог" + Порог;
		ЭлементПорог.Ширина			= ШиринаКолонки;
		//ЭлементПорог.Видимость		= ПоказыватьДействующуюЦену;
		//ЭлементПорог.ТолькоПросмотр= Истина;
		//ЭлементПорог.ЦветТекста	= ЦветаСтиля.НедоступныеДанныеЦвет;
		ЭлементПорог.РастягиватьПоГоризонтали = Ложь;
		
		ЭлементЦена 				= Элементы.Добавить(ПрефиксРеквизитов + "_Цена" + Порог, Тип("ПолеФормы"), ГруппаЦены);
		ЭлементЦена.Вид				= ВидПоляФормы.ПолеВвода;
		ЭлементЦена.ПутьКДанным	= 	ПутьРеквизита + "." + ПрефиксРеквизитов + "_Цена" + Порог;
		//ЭлементЦена.Ширина		= ШиринаКолонки;
		//ЭлементЦена.Видимость		= ПоказыватьИзменениеЦен;
		//ЭлементЦена.ТолькоПросмотр= Истина;
		//ЭлементЦена.ЦветТекста	= ЦветаСтиля.НедоступныеДанныеЦвет;
		ЭлементЦена.РастягиватьПоГоризонтали = Ложь;
		
		
		Если Порог = 1 Тогда
			Цвет = Новый Цвет(222, 242, 248);
		ИначеЕсли Порог = 2 Тогда
			Цвет = Новый Цвет(194, 231, 242);
		ИначеЕсли Порог = 3 Тогда
			Цвет = Новый Цвет(166, 220, 236);
		ИначеЕсли Порог = 4 Тогда
			Цвет = Новый Цвет(138, 209, 230);
		КонецЕсли;
		ЭлементПорог.ЦветФона = Цвет;
		ЭлементЦена.ЦветФона = Цвет;

	КонецЦикла;            

	//ЭлементНовая 				= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаНовая", Тип("ПолеФормы"), ГруппаЦена);
	//ЭлементНовая.Вид			= ВидПоляФормы.ПолеВвода;
	//ЭлементНовая.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаНовая";
	//ЭлементНовая.Ширина			= ШиринаКолонки;
	////ЭлементНовая.Видимость		= Объект.ПоказыватьНовуюЦену;
	////ЭлементНовая.УстановитьДействие("ПриИзменении", "Подключаемый_НоваяЦенаПриИзменении");
	//ЭлементНовая.РастягиватьПоГоризонтали = Ложь;
	//
	//ЭлементИзменили 			= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенуИзменили", Тип("ПолеФормы"), ГруппаЦена);
	//ЭлементИзменили.Вид			= ВидПоляФормы.ПолеВвода;
	//ЭлементИзменили.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенуИзменили";
	//ЭлементИзменили.Видимость	= Ложь;
	//
	//ЭлементЦенаКДо 					= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаКДо", Тип("ПолеФормы"), ГруппаЦенаК);
	//ЭлементЦенаКДо.Вид				= ВидПоляФормы.ПолеВвода;
	//ЭлементЦенаКДо.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаКДо";
	//ЭлементЦенаКДо.Ширина			= ШиринаКолонки;
	//ЭлементЦенаКДо.Видимость		= ПоказыватьДействующуюЦену;
	//ЭлементЦенаКДо.ТолькоПросмотр	= Истина;
	//ЭлементЦенаКДо.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	//ЭлементЦенаКДо.РастягиватьПоГоризонтали = Ложь;
	//
	//ЭлементДельтаК 					= Элементы.Добавить(ПрефиксРеквизитов + "_ДельтаК", Тип("ПолеФормы"), ГруппаЦенаК);
	//ЭлементДельтаК.Вид				= ВидПоляФормы.ПолеВвода;
	//ЭлементДельтаК.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ДельтаК";
	//ЭлементДельтаК.Ширина			= ШиринаКолонки;
	//ЭлементДельтаК.Видимость		= ПоказыватьИзменениеЦен;
	//ЭлементДельтаК.ТолькоПросмотр	= Истина;
	//ЭлементДельтаК.ЦветТекста		= ЦветаСтиля.НедоступныеДанныеЦвет;
	//ЭлементДельтаК.РастягиватьПоГоризонтали = Ложь;
	//
	//ЭлементКоличество				= Элементы.Добавить(ПрефиксРеквизитов + "_Количество", Тип("ПолеФормы"), ГруппаЦенаК);
	//ЭлементКоличество.Вид			= ВидПоляФормы.ПолеВвода;
	//ЭлементКоличество.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_Количество";
	//ЭлементКоличество.Ширина		= ШиринаКолонки;
	//ЭлементКоличество.РастягиватьПоГоризонтали = Ложь;
	////ЭлементКоличество.ГиперссылкаЯчейки = Истина;
	//
	//ЭлементНоваяК 					= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенаКНовая", Тип("ПолеФормы"), ГруппаЦенаК);
	//ЭлементНоваяК.Вид				= ВидПоляФормы.ПолеВвода;
	//ЭлементНоваяК.ПутьКДанным		= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенаКНовая";
	//ЭлементНоваяК.Ширина			= ШиринаКолонки;
	////ЭлементНоваяК.Видимость		= Объект.ПоказыватьНовуюЦену;
	////ЭлементНоваяК.УстановитьДействие("ПриИзменении", "Подключаемый_НоваяЦенаПриИзменении");
	//ЭлементНоваяК.РастягиватьПоГоризонтали = Ложь;
	//
	//ЭлементКИзменили 				= Элементы.Добавить(ПрефиксРеквизитов + "_ЦенуКИзменили", Тип("ПолеФормы"), ГруппаЦенаК);
	//ЭлементКИзменили.Вид			= ВидПоляФормы.ПолеВвода;
	//ЭлементКИзменили.ПутьКДанным	= ПутьРеквизита + "." + ПрефиксРеквизитов + "_ЦенуКИзменили";
	//ЭлементКИзменили.Видимость		= Ложь;
	
КонецПроцедуры
	
#КонецОбласти


#Область События_ТЗ_Товары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(Элементы.Товары.ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Для каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.Номенклатура = ВыбранноеЗначение И СтрокаТЧ <> Элементы.Товары.ТекущиеДанные Тогда
			клОшибка(СтрШаблон("%1 %2!", НСтр("ru = 'Такая номенклатура уже есть в строке'; en = 'This good is already in the document, line'"), СтрокаТЧ.Ном));
			Элементы.Товары.ТекущиеДанные.Номенклатура = НоменклатураТекущейСтроки;		
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("ТоварыПередУдалениемЗавершение", ЭтотОбъект, Стр),
		НСтр("ru = 'Удалить строку?'; en = 'Delete line?'"));

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалениемЗавершение(Результат, Стр) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Объект.Товары.Удалить(Стр);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НоменклатураТекущейСтроки = Элементы.Товары.ТекущиеДанные.Номенклатура;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  

	Если Поле.Имя = "ТоварыОстаток" Тогда
	
		Отбор = Новый Структура("Товар", Элемент.ТекущиеДанные.Номенклатура);
		ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Отбор, Истина, "ОстаткиОднойНоменклатуры");
		ОткрытьФорму("Отчет.ОстаткиТовара.Форма", ПараметрыФормы, ЭтаФорма, , );
	
	ИначеЕсли Поле.Имя = "ТоварыЗакупка" Тогда

		//Отбор = Новый Структура("Товар", Элемент.ТекущиеДанные.Номенклатура);
		//ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии, КлючВарианта", Отбор, Истина, "ОстаткиОднойНоменклатуры");  
		ПараметрыФормы = Новый Структура("Номенклатура, СформироватьПриОткрытии", Элемент.ТекущиеДанные.Номенклатура, Истина);
		ОткрытьФорму("Обработка.ЦеныПоставщиков.Форма", ПараметрыФормы, ЭтаФорма, , );

	Иначе
	
		
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент) 
	
	ПересчитатьНомераСтрокТЗ(Элемент);

КонецПроцедуры

#КонецОбласти     


#Область Служебные

&НаСервереБезКонтекста
Функция СтрокаБуквами(Стр)
	
	Возврат СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("!№;%:?*() -=+/|\.,<>{}[]&#@~", Стр, "");

КонецФункции 

&НаКлиенте
Процедура ПересчитатьНомераСтрокТЗ(Элемент)

	Для каждого Стр Из Товары Цикл
	    Стр.Ном = Товары.Индекс(Стр)+1;    
	КонецЦикла; 

КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПрефиксВидаЦен(ВидЦены)
//	
//	Если НЕ ЗначениеЗаполнено(ВидЦены) Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	ИменаПредопределенных = Метаданные.Справочники.ВидыЦен.ПолучитьИменаПредопределенных();
//	Для Каждого ИмяПредопределенного Из ИменаПредопределенных Цикл
//		Если Справочники.ВидыЦен[ИмяПредопределенного] = ВидЦены Тогда
//			Возврат ИмяПредопределенного;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат СтрЗаменить(ВидЦены.Наименование, " ", "");
//	
//КонецФункции

&НаСервереБезКонтекста
Функция ОтобраннаяНоменклатура(ВариантОтбора, ЗначениеОтбора)
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Номенклатура.Ссылка
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	НЕ Номенклатура.ПометкаУдаления
	             |	И НЕ Номенклатура.ЭтоГруппа
	             |	И ИСТИНА = ИСТИНА";
	Если ВариантОтбора = "ГруппаНоменклатуры" Тогда
		Условие = "Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)";
	ИначеЕсли ВариантОтбора = "Менеджер" Тогда
		//Условие = "Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)";	
	
	КонецЕсли;
	Запр.Текст = СтрЗаменить(Запр.Текст, "ИСТИНА = ИСТИНА", Условие);
	Выгрузка = Запр.Выполнить().Выгрузить();
	Возврат Выгрузка.ВыгрузитьКолонку(0);

КонецФункции 

#КонецОбласти  


#Область КомандыФормы

&НаКлиенте
Процедура УстановитьВидимостьКолонок()
	
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыКартинка.Видимость = ПоказыватьСпецификацию;
	Элементы.Товары.ПодчиненныеЭлементы.ТоварыЗакупка.Видимость = ПоказыватьЦенуЗакупки;
	Для Инд = 6 По Элементы.Товары.ПодчиненныеЭлементы.Количество() - 1 Цикл 
		Для каждого Элемент Из Элементы.Товары.ПодчиненныеЭлементы[Инд].ПодчиненныеЭлементы Цикл
			Если Прав(Элемент.Имя, 7) = "_ГрЦена" ИЛИ Прав(Элемент.Имя, 8) = "_ГрЦенаК" Тогда
				Для каждого Элт Из Элемент.ПодчиненныеЭлементы Цикл
					Если Прав(Элт.Имя, 7) = "_ЦенаДо" ИЛИ Прав(Элт.Имя, 8) = "_ЦенаКДо" Тогда
						Элт.Видимость = ПоказыватьДействующуюЦену;
					ИначеЕсли Прав(Элт.Имя, 7) = "_Дельта" ИЛИ Прав(Элт.Имя, 8) = "_ДельтаК" Тогда
						Элт.Видимость = ПоказыватьИзменениеЦен;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли	
		КонецЦикла;	
	КонецЦикла;	
	  
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеТоваров(Команда)
	
	ЗаполнитьТЧСВопросом(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)

	ЗаполнитьТЧСВопросом(Команда.Имя);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ОстаткиТовара.Номенклатура КАК Номенклатура,
	             |	ОстаткиТовара.ОстатокОстаток КАК Остаток
	             |ИЗ
	             |	РегистрНакопления.ОстаткиТовара.Остатки(&ДатаОстатков, Склад = &Склад) КАК ОстаткиТовара
	             |ГДЕ
	             |	НЕ ОстаткиТовара.Номенклатура.ЗапретОтгрузки
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номенклатура";
	Запр.УстановитьПараметр("ДатаОстатков", Объект.Дата);
	Запр.УстановитьПараметр("Склад", Объект.Склад); 
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
		Если НайдСтроки.Количество() = 0 Тогда
			СтрокаТЗ = Товары.Добавить();
			СтрокаТЗ.Номенклатура = Выборка.Номенклатура;
		Иначе
			СтрокаТЗ = НайдСтроки[0];
		КонецЕсли;
		СтрокаТЗ.Остаток = Выборка.Остаток;
		СтрокаТЗ.Картинка = Выборка.Картинка;
	
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоБренду(Команда)
	
	ЗаполнитьТЧСВопросом(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда) 
	
	Номенклатура = Новый СписокЗначений;
	Для каждого СтрокаТЗ Из Товары Цикл
		Номенклатура.Добавить(СтрокаТЗ.Номенклатура);	
	КонецЦикла;

	///Создаем структуру с отбором и добавляем значения
	ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары"));
	//ПараметрыОтбора.Вставить("Дата", ТекущаяДата());   ///Дополнительный отбор
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы

	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ВыбраннаяНоменклатура", Номенклатура);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Подбор");

	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНезаполненные(Команда)
	
	Ном = Товары.Количество() - 1;
	Пока Ном >= 0 Цикл     
		ЕстьДанные = Ложь;
		Для каждого ТипЦены Из КэшДанных.ТипыЦен Цикл
			Префикс = ТипЦены.Представление;
			СтрокаТЗ = Товары[Ном];
			Если СтрокаТЗ[Префикс + "_ЦенаНовая"] > 0 ИЛИ СтрокаТЗ[Префикс + "_ЦенаКНовая"] > 0 ИЛИ СтрокаТЗ[Префикс + "_Количество"] > 0 Тогда
				ЕстьДанные = Истина;
			КонецЕсли;	
		КонецЦикла; 	
		Если НЕ ЕстьДанные Тогда
			Товары.Удалить(Ном); 
			Модифицированность = Истина;
		КонецЕсли;
		Ном = Ном - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)  
	
	Номенклатура = Новый Массив;
	Для каждого СтрокаТЗ Из Товары Цикл
		Номенклатура.Добавить(СтрокаТЗ.Номенклатура);	
	КонецЦикла;
	ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(Номенклатура); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧСВопросом(РежимЗаполнения)

	Если Товары.Количество() = 0 Тогда 
		Если РежимЗаполнения = "ЗаполнитьПоОстаткам" Тогда
			ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",,ЭтаФорма);
		ИначеЕсли РежимЗаполнения = "ЗаполнитьПоГруппеТоваров" Тогда
			ЗаполнитьПоОстаткамНаСервере(); 
		ИначеЕсли РежимЗаполнения = "ЗаполнитьПоБренду" Тогда
			
		КонецЕсли;	
	Иначе	
		Режим = РежимДиалогаВопрос.ДаНет; 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОчистки", ЭтотОбъект, Новый Структура("РежимЗаполнения", РежимЗаполнения));
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Табличная часть не пуста! Очистить?'; en = 'The table part is not empty! Clear?'"), Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОчистки(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        Товары.Очистить();
	КонецЕсли;
	
	Если Параметры.РежимЗаполнения = "ЗаполнитьПоОстаткам" Тогда
		ЗаполнитьПоОстаткамНаСервере(); 
	ИначеЕсли Параметры.РежимЗаполнения = "ЗаполнитьПоГруппеТоваров" Тогда
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",,ЭтаФорма);
	ИначеЕсли Параметры.РежимЗаполнения = "ЗаполнитьПоБренду" Тогда
		
	КонецЕсли;	

КонецПроцедуры 

#КонецОбласти    


&НаСервере 
// В таб.части заполняет колонки: Картинка, Остаток, Закупка, ЦеныДо
//
Процедура ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(Номенклатура = Неопределено)
	
	Если Номенклатура = Неопределено Тогда
	    масНоменклатура = Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку(0);
	Иначе	
		масНоменклатура = Номенклатура;
	КонецЕсли;
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("Номенклатура", масНоменклатура);
	Запр.УстановитьПараметр("ДатаОстатков", Объект.Дата);   
	Запр.Текст = "ВЫБРАТЬ
	             |	СпрНоменклатура.Ссылка КАК Номенклатура,
	             |	ЗначенияСвойств.ЗначениеСвойства.Наименование КАК Картинка,
	             |	ОстаткиТовараОстатки.ОстатокОстаток КАК Остаток,
	             |	ЦеныПродажи.ВидЦены КАК ВидЦены,
	             |	ЦеныПродажи.Цена0 КАК Цена0,
	             |	ЦеныЗакупки.Цена КАК ЦенаЗакупки,
	             |	ЦеныЗакупки.Валюта КАК ВалютаЗакупки
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		Номенклатура.Ссылка КАК Ссылка
	             |	ИЗ
	             |		Справочник.Номенклатура КАК Номенклатура
	             |	ГДЕ
	             |		Номенклатура.Ссылка В(&Номенклатура)) КАК СпрНоменклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	             |			ЗначенияСвойствОбъектов.ЗначениеСвойства КАК ЗначениеСвойства
	             |		ИЗ
	             |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             |		ГДЕ
	             |			ЗначенияСвойствОбъектов.ЗначениеСвойства.Владелец.Наименование = ""Спецификация"") КАК ЗначенияСвойств
	             |		ПО СпрНоменклатура.Ссылка = ЗначенияСвойств.Объект
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ОстаткиТовараОстатки
	             |		ПО СпрНоменклатура.Ссылка = ОстаткиТовараОстатки.Номенклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи.СрезПоследних(&ДатаОстатков, Номенклатура В (&Номенклатура)) КАК ЦеныПродажи
	             |		ПО СпрНоменклатура.Ссылка = ЦеныПродажи.Номенклатура
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныЗакупки.СрезПоследних КАК ЦеныЗакупки
	             |		ПО СпрНоменклатура.Ссылка = ЦеныЗакупки.Номенклатура";
	ОбщегоНазначения.ДополнитьТекстЗапросаСпецификациями(Запр.Текст, "ЗначенияСвойств.ЗначениеСвойства.Наименование");
	Выгрузка = Запр.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДанных ИЗ Выгрузка Цикл
		СтрокаТЗ = Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДанных.Номенклатура))[0];
		СтрокаТЗ.Картинка 					= СтрокаДанных.Картинка; 
		СтрокаТЗ.Остаток 					= СтрокаДанных.Остаток; 
		СтрокаТЗ.Закупка 					= СтрШаблон("%1 %2", Формат(СтрокаДанных.ЦенаЗакупки, "ЧДЦ=2"), СтрокаДанных.ВалютаЗакупки); 
		//Если СтрокаДанных.ВидЦены <> Null Тогда
		//	Префикс = КэшДанных.ПрефиксыВидовЦен.Получить(СтрокаДанных.ВидЦены);
		//	СтрокаТЗ[Префикс + "_ЦенаДо"] = СтрокаДанных.Цена;
		//	СтрокаТЗ[Префикс + "_ЦенаКДо"] = СтрШаблон("%1 %2 %3", Формат(СтрокаДанных.ЦенаОтКоличества, "ЧДЦ=2"), НСтр("ru = 'от'; en = 'from'"), СтрокаДанных.Количество);
		//КонецЕсли;
	КонецЦикла;  	
	
	Ном = 0;
	Для каждого СтрокаТЗ Из Товары Цикл
		Ном = Ном + 1;
		СтрокаТЗ.Ном = Ном;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуЗначенийТовары(ЗначениеОтбора)

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("МассивНоменклатуры", ЗначениеОтбора); 
	Запр.УстановитьПараметр("Исключения", Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку(0)); 
	Запр.Текст = "ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Номенклатура
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Ссылка В(&МассивНоменклатуры)
	             |	И НЕ Номенклатура.Ссылка В (&Исключения)
				 |	И НЕ Номенклатура.ЭтоГруппа
				 |	И НЕ Номенклатура.ПометкаУдаления";  
	Если ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если ЗначениеОтбора.ЭтоГруппа Тогда
			Запр.Текст = СтрЗаменить(Запр.Текст, 
									"В(&МассивНоменклатуры)", 
									"В ИЕРАРХИИ(&МассивНоменклатуры)");	
		КонецЕсли; 
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.ГруппыПодбораНоменклатуры") Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, 
									"Номенклатура.Ссылка В(&МассивНоменклатуры)", 
									"Номенклатура.ГруппаПодбора В ИЕРАРХИИ(&МассивНоменклатуры)");	   
	ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Производители") Тогда
		Запр.Текст = СтрЗаменить(Запр.Текст, 
									"Номенклатура.Ссылка В(&МассивНоменклатуры)", 
									"Номенклатура.Производитель = &МассивНоменклатуры");	   
	КонецЕсли;  
	РезультатЗапроса = Запр.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = Товары.Добавить();
		НовСтрока.Номенклатура 	= Выборка.Номенклатура; 
		НовСтрока.Ном 			= Товары.Количество();
	КонецЦикла;
	ЗаполнитьТЗИсторическимиДаннымиНоменклатуры(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура"));

КонецПроцедуры


&НаКлиенте
Процедура ПродаватьВсе(Команда)
	
	ПродаватьВсе = НЕ ПродаватьВсе;
	ОбновитьОтображениеЭлементов();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИндикаторКоманды(ИмяКоманды, Вкл)

	Команды[ИмяКоманды].Картинка = ?(Вкл, БиблиотекаКартинок.Вкл, БиблиотекаКартинок.Выкл);	

КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Документ.УстановкаЦен.Форма.ФормаПересчета", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьСНаценкой(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНаценки", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение, 1, НСтр("ru = 'Наценка, %'; en = 'Наценка, %'"), 5, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНаценки(Число, Параметры) Экспорт
	
	Если Число <> Неопределено Тогда
		Для каждого СтрокаТЧ Из Товары Цикл
			Для каждого Префикс Из КэшДанных.ПрефиксыВидовЦен Цикл 
				Преф = Префикс.Значение;
				СтрокаТЧ[Преф + "_Цена0"] = СтрокаТЧ[Преф + "_ЦенаСтар"] * Число / 100;
			КонецЦикла;
		КонецЦикла;
    КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ПоВсемСкладамПриИзменении(Элемент) 
	
	ОбновитьОтображениеЭлементов();   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()

	Элементы.ТоварыКоманднаяПанель.ПодчиненныеЭлементы.ТоварыПродаватьВсе.Пометка = ПродаватьВсе;
	УстановитьИндикаторКоманды("ПродаватьВсе", ПродаватьВсе);
	Элементы.СкладыСтрокой.Видимость = НЕ ПоВсемСкладам;
	Если Склады.Количество() = 0 Тогда
		СкладыСтрокой = НСтр("ru = '<не выбраны>'; en = '<not selected>'")	
	Иначе 
		Загл = "";
		Для каждого Эл Из Склады Цикл
		 	Загл = Загл + Эл.Значение + ", ";
		КонецЦикла;
		СкладыСтрокой = Загл;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыСтрокойНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);
	СладыДляВыбора = СладыДляВыбора(Склады);
	СладыДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, НСтр("ru = 'Остатки на складах'; en = 'Warehouse balances'"));

КонецПроцедуры

  
&НаСервереБезКонтекста
Функция СладыДляВыбора(СписокПомеченных)
	
	Спис = Новый СписокЗначений;
	Запр = новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Склады.Ссылка КАК Ссылка,
	             |	ИСТИНА КАК Пометка
	             |ИЗ
	             |	Справочник.Склады КАК Склады
	             |ГДЕ
	             |	НЕ Склады.ПометкаУдаления
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Склады.Наименование";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	 	Спис.Добавить(Выборка.Ссылка, , СписокПомеченных.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено);
	КонецЦикла;
	Возврат Спис;
	
КонецФункции // СладыДляВыбора()


&НаКлиенте
Процедура ПослеОтметкиЭлементов(Список, Параметры) Экспорт
	
	Если Список <> Неопределено Тогда  
		Склады.Очистить();
        Для каждого Элемент из Список Цикл
            Если Элемент.Пометка Тогда
				Склады.Добавить(Элемент.Значение); 
            КонецЕсли;
        КонецЦикла;
	КонецЕсли; 
	ОбновитьОтображениеЭлементов();

КонецПроцедуры


#Область Настройки
	
#Область ТипыЦен

&НаКлиенте
Процедура СписокТипыЦенПометкаПриИзменении(Элемент)
	
	// перенесем пометки с формы в ТЧ док-та; изменим видимость группы колонок
	
	Для каждого ВидЦены Из СписокВыбранныеВидыЦен Цикл  
		НайдСтроки = Объект.ВидыЦен.НайтиСтроки(Новый Структура("ВидЦены", ВидЦены.Значение));
		Если НайдСтроки.Количество() = 0 Тогда
			СтрокаТЧ = Неопределено;
		Иначе
			СтрокаТЧ = НайдСтроки[0];
		КонецЕсли;
		Если ВидЦены.Пометка И СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = Объект.ВидыЦен.Добавить();	
		    СтрокаТЧ.ВидЦены = ВидЦены.Значение;    
			Модифицированность = Истина;
		ИначеЕсли НЕ ВидЦены.Пометка И СтрокаТЧ <> Неопределено Тогда
        	Объект.ВидыЦен.Удалить(СтрокаТЧ);
			Модифицированность = Истина;
		КонецЕсли;
		//      
		Префикс = КэшДанных.ПрефиксыВидовЦен.Получить(ВидЦены.Значение);
		Элементы[Префикс].Видимость = ВидЦены.Пометка;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТипыЦенПередУдалением(Элемент, Отказ)
      Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокТипыЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
      Отказ = Истина;
КонецПроцедуры

#КонецОбласти 

#КонецОбласти


&НаКлиенте
Процедура КоличествоПороговЦенРегулирование(Элемент, Направление, СтандартнаяОбработка)
	КоличествоПороговЦенПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПороговЦенПриИзменении(Элемент)
	
	Для каждого СтрокаТЧ Из Объект.ВидыЦен Цикл     
		Префикс = КэшДанных.ПрефиксыВидовЦен.Получить(СтрокаТЧ.ВидЦены);
		Для Порог = 1 По 3 Цикл
			Элементы[Префикс + "_Порог" + Порог].Видимость = Порог <= Объект.ПороговЦен;
			Элементы[Префикс + "_Цена" + Порог].Видимость = Порог <= Объект.ПороговЦен;
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры
